{
    "format": "PyTorch",
    "modelTopology": {
        "layers": [
            {
                "type": "conv2d",
                "filters": 32,
                "kernelSize": 3
            },
            {
                "type": "maxpool2d",
                "size": 2
            },
            {
                "type": "conv2d",
                "filters": 64,
                "kernelSize": 3
            },
            {
                "type": "maxpool2d",
                "size": 2
            },
            {
                "type": "conv2d",
                "filters": 128,
                "kernelSize": 3
            },
            {
                "type": "maxpool2d",
                "size": 2
            },
            {
                "type": "flatten"
            },
            {
                "type": "dense",
                "units": 512
            },
            {
                "type": "dense",
                "units": 10
            }
        ]
    }
}